### 🌊 Neptune Apply Results

**Terraform Stacks:** `apps/web, apps/web/ci-102-1, apps/web/ci-102-2`

**Neptune completed the apply with status:** ✅
> For more details, see the [GitHub Actions run](https://github.com/devopsfactory-io/neptune-tests/actions/runs/23396202968)

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web] 05:09:23.128 INFO   Downloading Terraform configurations from ../../_modules/null-stack into ./.terragrunt-cache/6P9tidISWBB3QzlNzQtu-E3IDNE/wXSEdkNd5e5MY27MFN0bjqcoO98
05:09:23.521 INFO   tofu: Initializing the backend...
05:09:24.031 INFO   tofu: 
05:09:24.031 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:09:24.031 INFO   tofu: use this backend unless the backend configuration changes.
05:09:24.240 INFO   tofu: Initializing provider plugins...
05:09:24.240 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:09:24.399 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:09:24.950 INFO   tofu: - Installing hashicorp/null v3.2.4...
05:09:25.389 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:09:25.726 INFO   tofu: - Installing hashicorp/local v2.7.0...
05:09:26.140 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:09:26.140 INFO   tofu: Providers are signed by their developers.
05:09:26.140 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:09:26.140 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:09:26.140 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:09:26.140 INFO   tofu: selections it made above. Include this file in your version control repository
05:09:26.140 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
05:09:26.140 INFO   tofu: you run "tofu init" in the future.
05:09:26.140 INFO   tofu: OpenTofu has been successfully initialized!
05:09:26.140 INFO   tofu: 
05:09:26.140 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:09:26.141 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:09:26.141 INFO   tofu: should now work.
05:09:26.141 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:09:26.141 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
05:09:26.141 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web] 05:09:27.067 STDOUT tofu: null_resource.stack: Refreshing state... [id=5873597553842205034]
05:09:27.070 STDOUT tofu: local_file.output: Refreshing state... [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
05:09:27.079 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:09:27.080 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:09:27.080 STDOUT tofu:   + create
05:09:27.080 STDOUT tofu: OpenTofu will perform the following actions:
05:09:27.080 STDOUT tofu:   # local_file.output will be created
05:09:27.080 STDOUT tofu:   + resource "local_file" "output" {
05:09:27.080 STDOUT tofu:       + content              = "apps/web deployed"
05:09:27.080 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:09:27.080 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:09:27.081 STDOUT tofu:       + content_md5          = (known after apply)
05:09:27.081 STDOUT tofu:       + content_sha1         = (known after apply)
05:09:27.081 STDOUT tofu:       + content_sha256       = (known after apply)
05:09:27.081 STDOUT tofu:       + content_sha512       = (known after apply)
05:09:27.081 STDOUT tofu:       + directory_permission = "0777"
05:09:27.081 STDOUT tofu:       + file_permission      = "0777"
05:09:27.081 STDOUT tofu:       + filename             = "./output.txt"
05:09:27.081 STDOUT tofu:       + id                   = (known after apply)
05:09:27.081 STDOUT tofu:     }
05:09:27.081 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:09:27.081 STDOUT tofu: 
05:09:27.114 STDOUT tofu: local_file.output: Creating...
05:09:27.116 STDOUT tofu: local_file.output: Creation complete after 0s [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
05:09:27.117 STDOUT tofu: 
05:09:27.117 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
05:09:27.117 STDOUT tofu: 
```

</details>

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web/ci-102-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-1] 05:09:27.405 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/LjDMVE2jnA-r4KEPw1_3gHdJxtE/wXSEdkNd5e5MY27MFN0bjqcoO98
05:09:27.800 INFO   tofu: Initializing the backend...
05:09:28.246 INFO   tofu: 
05:09:28.246 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:09:28.246 INFO   tofu: use this backend unless the backend configuration changes.
05:09:28.470 INFO   tofu: Initializing provider plugins...
05:09:28.470 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:09:28.590 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:09:28.992 INFO   tofu: - Installing hashicorp/null v3.2.4...
05:09:29.387 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:09:29.748 INFO   tofu: - Installing hashicorp/local v2.7.0...
05:09:30.173 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:09:30.173 INFO   tofu: Providers are signed by their developers.
05:09:30.173 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:09:30.173 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:09:30.173 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:09:30.173 INFO   tofu: selections it made above. Include this file in your version control repository
05:09:30.173 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
05:09:30.173 INFO   tofu: you run "tofu init" in the future.
05:09:30.173 INFO   tofu: OpenTofu has been successfully initialized!
05:09:30.173 INFO   tofu: 
05:09:30.173 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:09:30.173 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:09:30.173 INFO   tofu: should now work.
05:09:30.173 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:09:30.173 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
05:09:30.173 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web/ci-102-1] 05:09:31.090 STDOUT tofu: local_file.output: Refreshing state... [id=1f4f63dac9cb80d65f6be29552c2cb03b26900f6]
05:09:31.090 STDOUT tofu: null_resource.stack: Refreshing state... [id=513367671554999496]
05:09:31.098 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:09:31.099 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:09:31.099 STDOUT tofu:   + create
05:09:31.099 STDOUT tofu: OpenTofu will perform the following actions:
05:09:31.099 STDOUT tofu:   # local_file.output will be created
05:09:31.099 STDOUT tofu:   + resource "local_file" "output" {
05:09:31.099 STDOUT tofu:       + content              = "apps/web/ci-102-1 deployed"
05:09:31.099 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:09:31.099 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:09:31.099 STDOUT tofu:       + content_md5          = (known after apply)
05:09:31.099 STDOUT tofu:       + content_sha1         = (known after apply)
05:09:31.099 STDOUT tofu:       + content_sha256       = (known after apply)
05:09:31.099 STDOUT tofu:       + content_sha512       = (known after apply)
05:09:31.099 STDOUT tofu:       + directory_permission = "0777"
05:09:31.099 STDOUT tofu:       + file_permission      = "0777"
05:09:31.099 STDOUT tofu:       + filename             = "./output.txt"
05:09:31.099 STDOUT tofu:       + id                   = (known after apply)
05:09:31.099 STDOUT tofu:     }
05:09:31.099 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:09:31.099 STDOUT tofu: 
05:09:31.134 STDOUT tofu: local_file.output: Creating...
05:09:31.136 STDOUT tofu: local_file.output: Creation complete after 0s [id=1f4f63dac9cb80d65f6be29552c2cb03b26900f6]
05:09:31.137 STDOUT tofu: 
05:09:31.137 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
05:09:31.137 STDOUT tofu: 
```

</details>

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web/ci-102-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-2] 05:09:31.418 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/Yc3gcfg0bxbyefOz0IsZf6F6epE/wXSEdkNd5e5MY27MFN0bjqcoO98
05:09:31.783 INFO   tofu: Initializing the backend...
05:09:32.233 INFO   tofu: 
05:09:32.233 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:09:32.233 INFO   tofu: use this backend unless the backend configuration changes.
05:09:32.496 INFO   tofu: Initializing provider plugins...
05:09:32.496 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:09:32.757 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:09:33.152 INFO   tofu: - Installing hashicorp/local v2.7.0...
05:09:33.558 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:09:33.916 INFO   tofu: - Installing hashicorp/null v3.2.4...
05:09:34.354 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:09:34.354 INFO   tofu: Providers are signed by their developers.
05:09:34.354 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:09:34.354 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:09:34.354 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:09:34.354 INFO   tofu: selections it made above. Include this file in your version control repository
05:09:34.354 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
05:09:34.354 INFO   tofu: you run "tofu init" in the future.
05:09:34.354 INFO   tofu: OpenTofu has been successfully initialized!
05:09:34.354 INFO   tofu: 
05:09:34.354 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:09:34.354 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:09:34.354 INFO   tofu: should now work.
05:09:34.354 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:09:34.354 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
05:09:34.354 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web/ci-102-2] 05:09:35.237 STDOUT tofu: null_resource.stack: Refreshing state... [id=2217601692384182174]
05:09:35.237 STDOUT tofu: local_file.output: Refreshing state... [id=bfc4796fd7ff08067e32d6c4b5782340cd83abe5]
05:09:35.245 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:09:35.245 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:09:35.245 STDOUT tofu:   + create
05:09:35.245 STDOUT tofu: OpenTofu will perform the following actions:
05:09:35.245 STDOUT tofu:   # local_file.output will be created
05:09:35.245 STDOUT tofu:   + resource "local_file" "output" {
05:09:35.245 STDOUT tofu:       + content              = "apps/web/ci-102-2 deployed"
05:09:35.245 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:09:35.245 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:09:35.246 STDOUT tofu:       + content_md5          = (known after apply)
05:09:35.246 STDOUT tofu:       + content_sha1         = (known after apply)
05:09:35.246 STDOUT tofu:       + content_sha256       = (known after apply)
05:09:35.246 STDOUT tofu:       + content_sha512       = (known after apply)
05:09:35.246 STDOUT tofu:       + directory_permission = "0777"
05:09:35.246 STDOUT tofu:       + file_permission      = "0777"
05:09:35.246 STDOUT tofu:       + filename             = "./output.txt"
05:09:35.246 STDOUT tofu:       + id                   = (known after apply)
05:09:35.246 STDOUT tofu:     }
05:09:35.246 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:09:35.246 STDOUT tofu: 
05:09:35.282 STDOUT tofu: local_file.output: Creating...
05:09:35.284 STDOUT tofu: local_file.output: Creation complete after 0s [id=bfc4796fd7ff08067e32d6c4b5782340cd83abe5]
05:09:35.285 STDOUT tofu: 
05:09:35.285 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
05:09:35.285 STDOUT tofu: 
```

</details>



Automatically merging because all changed stacks have been successfully applied.
